2025/programme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LSFA 2025</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="files/mystyle3.css" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgee907ac" class="outline-2">
<h2 id="orgee907ac">Programme</h2>
<div class="outline-text-2" id="text-orgee907ac">
</div>
<div id="outline-container-org0ebb24c" class="outline-3">
<h3 id="org0ebb24c">October 7:</h3>
<div class="outline-text-3" id="text-org0ebb24c">
<ul class="org-ul">
<li>10:30: <b>A Function-Set Framework: General Properties and Applications to Modal Logic.</b> Luke Bayzid, Alexandre Madeira and Manuel A. Martins</li>

<li>11:00: <b>Sequent Calculi for Data-Aware Modal Logics.</b> Carlos Areces, Valentin Cassano, Danae Dutto and Raul Fervari</li>

<li>11:30: <b>Characterization of Lattice Properties within Modal Extensions.</b> Alfredo R. Freire and Manuel A. Martins</li>
</ul>

<p>

</p>

<ul class="org-ul">
<li>14:00 <span class="underline">Invited Talk.</span>  <a href="https://risc.jku.at/m/teimuraz-kutsia/">Temur Kutsia</a>, Research Institute for Symbolic Computation (<a href="https://risc.jku.at/">RISC</a>), <a href="https://www.jku.at/">Johannes Kepler University</a> (joint Invited Speaker with <a href="https://cicm-conference.org/2025/cicm.php">CICM 2025</a>)</li>

<li>15:00 <span class="underline">Invited Talk.</span> <b>My Attempts To Save Politeness.</b>  <a href="https://u.cs.biu.ac.il/~zoharyo1/">Yoni Zohar</a>, Department of Computer Science, <a href="https://www.biu.ac.il/">Bar Ilan University</a></li>

<li>16:30: <b>Monoid Structures on Indexed Containers.</b> Michele De Pascalis, Tarmo Uustalu and Niccolò Veltrì</li>

<li>17:00: <b>Towards the HSP Theorem in Nominal Algebra with Fixed-Point Constraints</b> (Work in Progress). Ali K. Caires-Santos</li>

<li>17:30: <b>Business Meeting</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgb8e3bb8" class="outline-3">
<h3 id="orgb8e3bb8">October 8:</h3>
<div class="outline-text-3" id="text-orgb8e3bb8">
<ul class="org-ul">
<li>14:00 <span class="underline">Invited Talk.</span> <b>A Note on Propositional Dynamic Logic Expressiveness and Complexity.</b>  <a href="http://www2.ic.uff.br/~bruno/">Bruno Lopes</a>, Instituto de Computação, <a href="https://www.ic.uff.br/">Universidade Federal Fluminense</a></li>

<li>16:30: <b>Nominal Sets in Rocq.</b> Fabrício Sanches Paranhos and Daniel Ventura</li>

<li>17:00: <b>Termination modulo Commutativity for Nominal Systems</b> (Work in Progress). Daniella Santaguida</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
